<template>
  <div>
    <section class="py-12 bg-gray-2">
      <div class="container mx-auto px-4 md:px-0">
        <div class="grid grid-cols-12 gap-6">
          <div class="col-span-12">
            <h2 class="text-dark text-4xl font-bold mb-2">Отзывы о нас</h2>
          </div>
          <ReviewsRating />
          <div class="col-span-12">
            <div class="md:columns-2 md:gap-6">
              <ReviewsCard v-for="(item, i) in reviews" :key="i" :item="item" />
            </div>
          </div>
          <div class="col-span-12 text-center">
            <UiButton text="Показать еще" class="w-full" blue />
          </div>
        </div>
      </div>
    </section>
    <HomeProjects home-page />
    <HomeAdvant />
    <UiFormsFeedback />
  </div>
</template>

<script setup lang="ts">

const reviews = ref([
  {
    name: 'Лидия Захарова',
    date: '15 декабря 2022',
    text: `Очень понравилось отношение сотрудников салона. Проверили и приобрели авто за приемлемую цену. 
    Оформление быстрое, профессиональное. Нареканий нет! Большое спасибо нашему менеджеру за помощь. Отличный салон! 
    Посетив другие автосалоны, остановили свой выбор именно на Favorit motors, благодаря профессиональной консультации 
    менеджера Игнатова Василия. Все обстоятельно рассказал, предложил выгодную цену без навязывания ненужных дополнительных 
    опций. Купили автомобиль Hyundai Tucson. Василий провел сделку от начала и до конца, 
    получили огромное удовольствие от общения и покупки. Все честно и без обмана.`
  },
  {
    name: 'Михаил Григорьев',
    date: '15 декабря 2022',
    text: `Хороший автосалон. Машины новые, состояние отличное. Купил авто, менеджеры молодцы, большое спасибо! 
    Сделали скидку, подготовили машину, всё супер! В салоне чисто, есть кафе. Рекомендую.`
  },
  {
    name: 'Георгий Петров',
    date: '15 декабря 2022',
    text: `Приезжал на сервис, автомобиль Хёндэ Крета. Остался всем доволен, работа выполнена качественно, 
    по времени ждать долго не пришлось, комфортные условия пребывания, приятная атмосфера. Свой автомобиль 
    приобретал здесь же, поэтому рекомендую. Персонал приветливый, ориентированный на клиента. Отдельное 
    спасибо мастеру по приёмке, Сергею! Компании всех благ и процветания.`
  },
  {
    name: 'Федор Иванов',
    date: '15 декабря 2022',
    text: `Отличный салон, всё чётко, грамотно и пунктуально! Выражаю благодарность нашему менеджеру Шелия
     Мушни за индивидуальный подход , учёт всех нюансов и оперативность! С Вами такое радостное событие 
     как покупка машины стало вдвойне приятнее. Спасибо большое!`
  },
  {
    name: 'Анастасия Т.',
    date: '15 декабря 2022',
    text: `Отличный салон, всё чётко, грамотно и пунктуально! Выражаю благодарность нашему менеджеру 
    Шелия Мушни за индивидуальный подход , учёт всех нюансов и оперативность! С Вами такое радостное 
    событие как покупка машины стало вдвойне приятнее. Спасибо большое!`
  },
  {
    name: 'Александр',
    date: '15 декабря 2022',
    text: `Хороший автосалон. Машины новые, состояние отличное. Купил авто, менеджеры молодцы, большое 
    спасибо! Сделали скидку, подготовили машину, всё супер! В салоне чисто, есть кафе. Рекомендую.`
  },
  {
    name: 'Илья Владимиров',
    date: '15 декабря 2022',
    text: `Хороший автосалон. Машины новые, состояние отличное. Купил авто, менеджеры молодцы, большое 
    спасибо! Сделали скидку, подготовили машину, всё супер! В салоне чисто, есть кафе. Рекомендую.`
  },
  {
    name: 'Георгий Петров',
    date: '15 декабря 2022',
    text: `Приезжал на сервис, автомобиль Хёндэ Крета. Остался всем доволен, работа выполнена качественно, 
    по времени ждать долго не пришлось, комфортные условия пребывания, приятная атмосфера. Свой автомобиль 
    приобретал здесь же, поэтому рекомендую. Персонал приветливый, ориентированный на клиента. Отдельное 
    спасибо мастеру по приёмке, Сергею! Компании всех благ и процветания`
  },
  {
    name: 'Федор Иванов',
    date: '15 декабря 2022',
    text: `Отличный салон, всё чётко, грамотно и пунктуально! Выражаю благодарность нашему менеджеру 
    Шелия Мушни за индивидуальный подход , учёт всех нюансов и оперативность! С Вами такое радостное 
    событие как покупка машины стало вдвойне приятнее. Спасибо большое!`
  }
])

</script>

<style scoped>

</style>
